backend/controllers/ProductController.php

INSERT INTO `product` (`date`, `name`, `price`, `description`, `category_id`, `slug`, `meta_description`, `meta_keywords`) VALUES ('2015-05-19 19:58', 'Test', 34, '<p>dsfsdfsdf sdfsd </p>', 2, 'test', '', '')
INSERT INTO `image` (`model_id`) VALUES (1)
---
    public function actionCreate()
    {
        $model = new Product(['scenario' => 'create']);
        $model->date = date('Y-m-d H:i');

        if ($model->load(Yii::$app->request->post())) {
            $model->image = UploadedFile::getInstance($model, 'image');
            $model->images = UploadedFile::getInstances($model, 'images');

            if ($model->validate() && $model->save() && $model->image) {
                // Working directory
                $dir = Yii::getAlias('@frontend/web/uploads/product/' . $model->id);
                FileHelper::createDirectory($dir);

                // Save main image
                $model->image->saveAs($dir . '/main.jpg');