backend/controllers/StatusController.php

INSERT INTO `status` (`name`, `color`, `background`) VALUES ('В наличии', '#ffffff', '#6aa84f')
---
    public function actionCreate()
    {
        $model = new Status();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `status` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Status::findOne($id)) !== null) {