frontend/controllers/CatalogController.php

SELECT * FROM `product` WHERE `slug`='test'
---
    protected function findModel($slug)
    {
        if (($model = Product::findOne(['slug' => $slug])) !== null) {

SELECT * FROM `category` WHERE `slug`='vtoraa'
---
    protected function findCategory($slug)
    {
        if (($model = Category::findOne(['slug' => $slug])) !== null) {