frontend/controllers/SiteController.php

SELECT * FROM `product` ORDER BY `date` DESC LIMIT 8
---
    public function actionIndex()
    {
        $this->layout = 'fullwide';
        $dataProvider = new ArrayDataProvider([
            'allModels' => Product::find()->limit(8)->orderBy('date DESC')->all()
        ]);