backend/views/layouts/main.php

SELECT COUNT(*) FROM `order` WHERE `status`=1
---
/* @var $content string */

AppAsset::register($this);
$newOrders = Order::find()->where(['status' => Order::STATUS_NEW])->count();