frontend/views/catalog/view.php

        'title' => $model->name,
    ],
];
foreach (Image::findAll(['model_id' => $model->id]) as $image) {
---
SELECT * FROM `image` WHERE `model_id`=1