backend/views/product/_form.php

SELECT * FROM `category`
SELECT * FROM `status`
SELECT * FROM `image` WHERE `model_id` IS NULL
---
/* @var $model common\models\Product */
/* @var $form yii\widgets\ActiveForm */

$category_models = Category::find()->all();
$categories = ArrayHelper::map($category_models, 'id', 'name');

$status_models = Status::find()->all();
$statuses = ArrayHelper::map($status_models, 'id', 'name');

$image_models = Image::findAll(['model_id' => $model->id]);