backend/views/product/_search.php

/* @var $model common\models\ProductSearch */
/* @var $form yii\widgets\ActiveForm */

$category_models = Category::find()->all();
$categories = ArrayHelper::map($category_models, 'id', 'name');

$status_models = Status::find()->all();
---
SELECT * FROM `category`
SELECT * FROM `status`