backend/views/product/view.php

$this->params['breadcrumbs'][] = ['label' => Yii::t('backend/product', 'Products'), 'url' => ['index']];
$this->params['breadcrumbs'][] = $this->title;

$image_models = Image::findAll(['model_id' => $model->id]);
---
SELECT * FROM `image` WHERE `model_id`=1