frontend/views/site/index.php

SELECT * FROM `slide` ORDER BY `sortOrder`
---
$this->title = Yii::t('frontend/site', 'Home');

$slides = [];
foreach (Slide::find()->orderBy('sortOrder')->all() as $slide) {